{"pageProps":{"title":"Reflections for 2023","desc":"Reflections about myself and about my future.","date":"Sun Dec 25 2022 00:00:00 GMT+0000 (Coordinated Universal Time)","source":{"compiledSource":"var g=Object.defineProperty,u=Object.defineProperties;var d=Object.getOwnPropertyDescriptors;var i=Object.getOwnPropertySymbols;var r=Object.prototype.hasOwnProperty,s=Object.prototype.propertyIsEnumerable;var l=(e,t,a)=>t in e?g(e,t,{enumerable:!0,configurable:!0,writable:!0,value:a}):e[t]=a,n=(e,t)=>{for(var a in t||(t={}))r.call(t,a)&&l(e,a,t[a]);if(i)for(var a of i(t))s.call(t,a)&&l(e,a,t[a]);return e},m=(e,t)=>u(e,d(t));var h=(e,t)=>{var a={};for(var o in e)r.call(e,o)&&t.indexOf(o)<0&&(a[o]=e[o]);if(e!=null&&i)for(var o of i(e))t.indexOf(o)<0&&s.call(e,o)&&(a[o]=e[o]);return a};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(a){var o=a,{components:e}=o,t=h(o,[\"components\"]);return mdx(MDXLayout,m(n(n({},layoutProps),t),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,`I'm writing this blog post on Christmas Day. It's usually a date that I would not write something for this blog because it's just not a so fun date. After all, I have a strange relationship\nwith my family. But this year I got some temporary inspiration because of a small unhealthy (for myself) obsession that I'm having with a guy that knows about this and, as far as I know, does\nnot hurt him. This post is just a reflection about my experiences writing programming languages like the \"Nuko\" and \"Kind2\" programming languages, what I have learned about type checkers,\nparsing libraries, and functional programming, my personal struggles, and how I'm going to fix it to not end alone. Even though this isn't a particularly coherent or well-written text,\nI just want to express and reflect on my experiences this year.`),mdx(\"h1\",null,\"Programming Language Development\"),mdx(\"p\",null,`It's not a surprise to me that I have experienced a slowdown due to a lot of reasons related to my mental health, but to summarize: I have attempted to make A LOT of programming languages in Haskell and\nin a lot of dependently typed programming languages like Idris2 and Lean4. At the beginning of 2022, I tried to enter the Idris2 community with no success at all. I had no prior experience with\ncool and fashion proofs about practical things (I had just some limited experience with proofs about natural numbers lol) and a lot of things that I was trying to get from Haskell were not\nworking because Idris is a strict language and Haskell is a lazy one. So I made a lot of simple projects just to test some concepts and learn new things. Some of them are on my GitHub and\nothers I just deleted because the code was just an \"experiment\". However, I did create a base for a virtual DOM called \"Maka\" and a simple guide called \"Idris2Noobs\" that, even not complete,\nI believe that it's a good and easy-to-understand introduction to the language (if you disagree, please contribute!).`),mdx(\"p\",null,`One area I've focused on this year is type checkers. I've tried to write a lot of them and I learned a lot of concepts. Despite not being so good at creating new type checkers because of my limited\nexperience on the formal side of this thing, I think that I achieved a lot of good results. Some of the algorithms that I implemented this year was`),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"A simple Hindley-Milner type system with algorithm W\"),mdx(\"li\",{parentName:\"ul\"},\"A more advanced Hindley-Milner system using IORefs\"),mdx(\"li\",{parentName:\"ul\"},'The pure algorithm for \"Bidirectional type checking for higher rank polymorphism\"'),mdx(\"li\",{parentName:\"ul\"},'An impure algorithm based on \"Practical type inference for arbitrary-rank types\"'),mdx(\"li\",{parentName:\"ul\"},\"A number of simple type systems for dependently typed programming languages, most of which are type-in-type because I believe the universe hierarchy and Prop are too complicated for programmers (sorry mathematicians but I don't care so much about the Girard Paradox).\")),mdx(\"p\",null,`While learning the Lean4 programming language, I became obsessed with the performance of parsing libraries so I had to create my own LALR(1) Parser for Lean4\nAnd I did half of an LALR(1) parser while I was reading the book \"Modern Compiler Implementation in ML\" and I just lost my passion for Lean4. Then I had to create my own programming language again so I started a project called Nuko\nthat was a programming language that does not have dependent types (because I think they make the language much more difficult to compile), but it does have a higher rank polymorphism and higher kinded types\nthat are kind of essential for a Haskell like language. I Implemented a simple algorithm for coverage checking that I think is the same one that Rust uses and I just have to make compile lol... sometimes\nI say that Nuko is like Agda because you can type-check your programs but you'll never try to compile them into a useful thing.`),mdx(\"p\",null,`The name of the programming language is inspired by a character in a manga called Shoujo Shuumatsu, which I love because of its apocalyptic setting and melancholic feeling. I was feeling this way myself\nwhile writing Nuko, as I spent all of my free and non-free time on it (I even read some books during college classes... I'm in a really bad college, so I was able to get\ngood grades with minimal effort). One of the things that I love about Nuko is that I used De Bruijin Indices and HOAS to make a fast type checker and even not having no prior experience with\nsomething like that... It was really fun to write even if the final code is a mess.`),mdx(\"p\",null,`Then I quit my C# intern job to enter the Kindelia Foundation in order to improve the Kind2 programming language. In the beginning, I was not so confident, I was just a hobbyist programming language creator that tried to teach\neveryone about it because I like to teach and I had a lot of controversial opinions on programming languages but over 2022 I calmed down a little bit and started to recognize that these opinions don't matter\nso much, some programming languages are just based on ads and some people will just buy these ads as truths, build things on them and call it the best programming language. It gives me the same feeling of the\narticle about the \"blub\" programmer but I know that nothing will change, ads are one of the main tools of capitalism and technical merit does not matter so much for this kind of product. I think that I'm\nimproving the language slowly, some things that I tried to make are:`),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Refactoring of the code base in order to make it easier to make tooling\"),mdx(\"li\",{parentName:\"ul\"},\"Erasure checker (Kind was not throwing an error when someone tried to use an erased argument in a computationally relevant position)\"),mdx(\"li\",{parentName:\"ul\"},\"Better error messages (Tried to specialize a lot of them and make them colorful, easier to spot the error line)\")),mdx(\"p\",null,\"The things that I'm trying to make are:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Coverage checker (Based on Jesper Cockx paper about copattern matching)\"),mdx(\"li\",{parentName:\"ul\"},\"Incremental compilation module (Just to make it easier to make a Watch Mode, REPL and LSP)\"),mdx(\"li\",{parentName:\"ul\"},\"Termination Checker (I have never tried to make something like this)\")),mdx(\"p\",null,`I hope that the future of the Kind2 programming language will be really cool. I really love to work with compilers even if I don't have someone to state that I'm doing dumb decisions on the complex compiler that it will turn (I like it... I was just a\nhobbyist programming language creator until a few months ago).`),mdx(\"h1\",null,\"Personal struggles and reflections\"),mdx(\"p\",null,`In retrospect, this year has been a mix of personal struggles and learning experiences for me but I've not changed IRL. I still don't have friends in real life because of my social problems and I spent almost all of my time in\nfront of a monitor. It's something that I have to improve a lot so I'm going to define some objectives for 2023 that are not just related to code!`),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Gym: I think my body is almost giving up at this point... I think that gym will help me lol.\"),mdx(\"li\",{parentName:\"ul\"},\"Stop my addiction to using hoddies: I use black hoddies every time even if it's on a hot summer day.\"),mdx(\"li\",{parentName:\"ul\"},\"Start to learn music theory: I want to compose some songs because I really love music.\"),mdx(\"li\",{parentName:\"ul\"},\"Try to find a boyfriend: Uuugh it's hard but I think that I'll have a little bit more confidence after the gym.\"),mdx(\"li\",{parentName:\"ul\"},\"I want to get away from my homophobic parents.\"),mdx(\"li\",{parentName:\"ul\"},\"Write more about the things that I'm learning here!\")),mdx(\"p\",null,\"On the technology side of things I have other cool projects to focus on:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},`An website to interactively teach type theory based on a lot of books that I'm going to finish like \"Type Theory and Formal Proof\" and \"Homotopy type theory\".`),mdx(\"li\",{parentName:\"ul\"},\"The Vulpi programming language that is going to be used to write web services with dependent types and algebraic effects.\"),mdx(\"li\",{parentName:\"ul\"},\"Kind2 That I'll try to contribute even if I get fired :P (As you can see I'm not so confident)\"),mdx(\"li\",{parentName:\"ul\"},'A game with some friends on a discord server called \"Cantinho Transpirado\".')),mdx(\"p\",null,\"Let there be light again. (It's the name of a great song)\"))}MDXContent.isMDXComponent=!0;\n","scope":{}},"name":"2022-12-25-on-improving-myself-to-2033","id":0},"__N_SSG":true}